Tekla Open API Reference for Tekla Structures 2025
ReferenceModel.GetReferenceModelObjectByExternalGuid Method
 Gets reference model object by external (IFC) guid from this reference model.
 Namespace: Tekla.Structures.Model
 Assembly: Tekla.Structures.Model (in Tekla.Structures.Model.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public ReferenceModelObject GetReferenceModelObjectByExternalGuid(
	string externalGuid
)
Public Function GetReferenceModelObjectByExternalGuid (
	externalGuid As String
) As ReferenceModelObject
Parameters
externalGuid
Type: System.String
External (IFC) Guid of the reference object.
Return Value
Type: ReferenceModelObject
Reference model object with specified external guid.
See Also
Reference
ReferenceModel Class
Tekla.Structures.Model Namespace